; domain
(define (domain sudbuild)
  (:requirements :strips :typing :negative-preconditions)
  (:types
    digit cell row column subgrid - objects
  )

  (:predicates
    (BelongRow ?r - row ?c - cell) ;Indicates that cell ?c belongs to row ?r.
    (UsedRow ?r - row ?num - digit)
    (BelongColumn ?col - column ?c - cell)
    (UsedColumn ?col - column ?num - digit)
    (BelongSubgrid ?s - subgrid ?c - cell)
    (UsedSubgrid ?s - subgrid ?num - digit)
    (empty ?c - cell)
  )
  
  (:action place-digit
    :parameters (?num - digit ?c - cell ?r - row ?col - column ?s - subgrid)
    :precondition (and (empty ?c)
                       (BelongRow ?r ?c)
                       (BelongColumn ?col ?c)
                       (BelongSubgrid ?s ?c)
                       (not (UsedRow ?r ?num))
                       (not (UsedSubgrid ?s ?num))
                       (not (UsedColumn ?col ?num)))
    :effect (and (not (empty ?c))
                 (UsedColumn ?col ?num)
                 (UsedRow ?r ?num)
                 (UsedSubgrid ?s ?num))
  )
)

; problem
(define (problem sudoku9x9)
	(:domain sudbuild)
	(:objects
    	one two three four five six seven eight nine - digit
	    cell00 cell01 cell02 cell03 cell04 cell05 cell06 cell07 cell08 - cell
	    cell10 cell11 cell12 cell13 cell14 cell15 cell16 cell17 cell18 - cell
	    cell20 cell21 cell22 cell23 cell24 cell25 cell26 cell27 cell28 - cell
		cell30 cell31 cell32 cell33 cell34 cell35 cell36 cell37 cell38 - cell
		cell40 cell41 cell42 cell43 cell44 cell45 cell46 cell47 cell48 - cell
		cell50 cell51 cell52 cell53 cell54 cell55 cell56 cell57 cell58 - cell
	    row0 row1 row2 row3 row4 row5 - row
	    column0 column1 column2 column3 column4 column5 column6 column7 column8 - column
	    subgrid0 subgrid1 subgrid2 subgrid3 subgrid4 subgrid5 - subgrid
	)

	(:init
		;Cell connections
		(BelongRow row0 cell00) (BelongRow row0 cell01) (BelongRow row0 cell02) (BelongRow row0 cell03) (BelongRow row0 cell04) (BelongRow row0 cell05) (BelongRow row0 cell06) (BelongRow row0 cell07) (BelongRow row0 cell08)
        (BelongRow row1 cell10) (BelongRow row1 cell11) (BelongRow row1 cell12) (BelongRow row1 cell13) (BelongRow row1 cell14) (BelongRow row1 cell15) (BelongRow row1 cell16) (BelongRow row1 cell17) (BelongRow row1 cell18)
        (BelongRow row2 cell20) (BelongRow row2 cell21) (BelongRow row2 cell22) (BelongRow row2 cell23) (BelongRow row2 cell24) (BelongRow row2 cell25) (BelongRow row2 cell26) (BelongRow row2 cell27) (BelongRow row2 cell28)
        (BelongRow row3 cell30) (BelongRow row3 cell31) (BelongRow row3 cell32) (BelongRow row3 cell33) (BelongRow row3 cell34) (BelongRow row3 cell35) (BelongRow row3 cell36) (BelongRow row3 cell37) (BelongRow row3 cell38)
        (BelongRow row4 cell40) (BelongRow row4 cell41) (BelongRow row4 cell42) (BelongRow row4 cell43) (BelongRow row4 cell44) (BelongRow row4 cell45) (BelongRow row4 cell46) (BelongRow row4 cell47) (BelongRow row4 cell48)
        (BelongRow row5 cell50) (BelongRow row5 cell51) (BelongRow row5 cell52) (BelongRow row5 cell53) (BelongRow row5 cell54) (BelongRow row5 cell55) (BelongRow row5 cell56) (BelongRow row5 cell57) (BelongRow row5 cell58)
        
		(BelongColumn column0 cell00) (BelongColumn column0 cell10) (BelongColumn column0 cell20) (BelongColumn column0 cell30) (BelongColumn column0 cell40) (BelongColumn column0 cell50)
		(BelongColumn column1 cell01) (BelongColumn column1 cell11) (BelongColumn column1 cell21) (BelongColumn column1 cell31) (BelongColumn column1 cell41) (BelongColumn column1 cell51) 
		(BelongColumn column2 cell02) (BelongColumn column2 cell12) (BelongColumn column2 cell22) (BelongColumn column2 cell32) (BelongColumn column2 cell42) (BelongColumn column2 cell52) 
		(BelongColumn column3 cell03) (BelongColumn column3 cell13) (BelongColumn column3 cell23) (BelongColumn column3 cell33) (BelongColumn column3 cell43) (BelongColumn column3 cell53) 
		(BelongColumn column4 cell04) (BelongColumn column4 cell14) (BelongColumn column4 cell24) (BelongColumn column4 cell34) (BelongColumn column4 cell44) (BelongColumn column4 cell54) 
		(BelongColumn column5 cell05) (BelongColumn column5 cell15) (BelongColumn column5 cell25) (BelongColumn column5 cell35) (BelongColumn column5 cell45) (BelongColumn column5 cell55) 
		(BelongColumn column6 cell06) (BelongColumn column6 cell16) (BelongColumn column6 cell26) (BelongColumn column6 cell36) (BelongColumn column6 cell46) (BelongColumn column6 cell56)
		(BelongColumn column7 cell07) (BelongColumn column7 cell17) (BelongColumn column7 cell27) (BelongColumn column7 cell37) (BelongColumn column7 cell47) (BelongColumn column7 cell57) 
		(BelongColumn column8 cell08) (BelongColumn column8 cell18) (BelongColumn column8 cell28) (BelongColumn column8 cell38) (BelongColumn column8 cell48) (BelongColumn column8 cell58)

		(BelongSubgrid subgrid0 cell00) (BelongSubgrid subgrid0 cell01) (BelongSubgrid subgrid0 cell02) (BelongSubgrid subgrid0 cell10) (BelongSubgrid subgrid0 cell11) (BelongSubgrid subgrid0 cell12) (BelongSubgrid subgrid0 cell20) (BelongSubgrid subgrid0 cell21) (BelongSubgrid subgrid0 cell22)
		(BelongSubgrid subgrid1 cell03) (BelongSubgrid subgrid1 cell04) (BelongSubgrid subgrid1 cell05) (BelongSubgrid subgrid1 cell13) (BelongSubgrid subgrid1 cell14) (BelongSubgrid subgrid1 cell15) (BelongSubgrid subgrid1 cell23) (BelongSubgrid subgrid1 cell24) (BelongSubgrid subgrid1 cell25)
		(BelongSubgrid subgrid2 cell06) (BelongSubgrid subgrid2 cell07) (BelongSubgrid subgrid2 cell08) (BelongSubgrid subgrid2 cell16) (BelongSubgrid subgrid2 cell17) (BelongSubgrid subgrid2 cell18) (BelongSubgrid subgrid2 cell26) (BelongSubgrid subgrid2 cell27) (BelongSubgrid subgrid2 cell28)
		(BelongSubgrid subgrid3 cell30) (BelongSubgrid subgrid3 cell31) (BelongSubgrid subgrid3 cell32) (BelongSubgrid subgrid3 cell40) (BelongSubgrid subgrid3 cell41) (BelongSubgrid subgrid3 cell42) (BelongSubgrid subgrid3 cell50) (BelongSubgrid subgrid3 cell51) (BelongSubgrid subgrid3 cell52)
		(BelongSubgrid subgrid4 cell33) (BelongSubgrid subgrid4 cell34) (BelongSubgrid subgrid4 cell35) (BelongSubgrid subgrid4 cell43) (BelongSubgrid subgrid4 cell44) (BelongSubgrid subgrid4 cell45) (BelongSubgrid subgrid4 cell53) (BelongSubgrid subgrid4 cell54) (BelongSubgrid subgrid4 cell55)
		(BelongSubgrid subgrid5 cell36) (BelongSubgrid subgrid5 cell37) (BelongSubgrid subgrid5 cell38) (BelongSubgrid subgrid5 cell46) (BelongSubgrid subgrid5 cell47) (BelongSubgrid subgrid5 cell48) (BelongSubgrid subgrid5 cell56) (BelongSubgrid subgrid5 cell57) (BelongSubgrid subgrid5 cell58)

		(UsedRow row0 six) (UsedColumn column1 six) (UsedSubgrid subgrid0 six)
		(UsedRow row0 two) (UsedColumn column5 two) (UsedSubgrid subgrid1 two)
		(UsedRow row0 seven) (UsedColumn column8 seven) (UsedSubgrid subgrid2 seven)
		
		(UsedRow row1 four) (UsedColumn column2 four) (UsedSubgrid subgrid0 four)
		(UsedRow row1 eight) (UsedColumn column7 eight) (UsedSubgrid subgrid2 eight)
		
		(UsedRow row2 one) (UsedColumn column0 one) (UsedSubgrid subgrid0 one)
		(UsedRow row2 five) (UsedColumn column4 five) (UsedSubgrid subgrid1 five)

		(UsedRow row3 six) (UsedColumn column3 six) (UsedSubgrid subgrid4 six)
		(UsedRow row3 one) (UsedColumn column6 one) (UsedSubgrid subgrid5 one)

		(UsedRow row4 one) (UsedColumn column1 one) (UsedSubgrid subgrid3 one)
		(UsedRow row4 four) (UsedColumn column7 four) (UsedSubgrid subgrid5 four)
		
		(empty cell00)
		(empty cell02)
		(empty cell03)
		(empty cell04)
		(empty cell06)
		(empty cell07)
		
		(empty cell10)
		(empty cell11)
		(empty cell13)
		(empty cell14)
		(empty cell15)
		(empty cell16)
		(empty cell18)
		
		(empty cell21)
		(empty cell22)
		(empty cell23)
		(empty cell25)
		(empty cell26)
		(empty cell27)
		(empty cell28)

		(empty cell30)
		(empty cell31)
		(empty cell32)
		(empty cell34)
		(empty cell35)
		(empty cell37)
		(empty cell38)

		(empty cell40)
		(empty cell42)
		(empty cell43)
		(empty cell44)
		(empty cell45)
		(empty cell46)
		(empty cell48)

		(empty cell50)
		(empty cell51)
		(empty cell52)
		(empty cell53)
		(empty cell54)
		(empty cell55)
		(empty cell56)
		(empty cell57)
		(empty cell58)
		
	)
	(:goal
        (and
          (not (empty cell00))
          (not (empty cell01))
          (not (empty cell02))
          (not (empty cell03))
          (not (empty cell04))
          (not (empty cell05))
          (not (empty cell06))
          (not (empty cell07))
          (not (empty cell08))
          (not (empty cell10))
          (not (empty cell11))
          (not (empty cell12))
          (not (empty cell13))
          (not (empty cell14))
          (not (empty cell15))
          (not (empty cell16))
          (not (empty cell17))
          (not (empty cell18))
          (not (empty cell20))
          (not (empty cell21))
          (not (empty cell22))
          (not (empty cell23))
          (not (empty cell24))
          (not (empty cell25))
          (not (empty cell26))
          (not (empty cell27))
          (not (empty cell28))
          (not (empty cell30))
          (not (empty cell31))
          (not (empty cell32))
          (not (empty cell33))
          (not (empty cell34))
          (not (empty cell35))
          (not (empty cell36))
          (not (empty cell37))
          (not (empty cell38))
          (not (empty cell40))
          (not (empty cell41))
          (not (empty cell42))
          (not (empty cell43))
          (not (empty cell44))
          (not (empty cell45))
          (not (empty cell46))
          (not (empty cell47))
          (not (empty cell48))
          (not (empty cell50))
          (not (empty cell51))
          (not (empty cell52))
          (not (empty cell53))
          (not (empty cell54))
          (not (empty cell55))
          (not (empty cell56))
          (not (empty cell57))
          (not (empty cell58))
		)
    )
)

; plan
1. (place-digit four cell28 row2 column8 subgrid2)
   deleted: (empty cell28)
   added: (usedcolumn column8 four) (usedrow row2 four) (usedsubgrid subgrid2 four)
   goals met: 12 of 54
2. (place-digit six cell14 row1 column4 subgrid1)
   deleted: (empty cell14)
   added: (usedcolumn column4 six) (usedrow row1 six) (usedsubgrid subgrid1 six)
   goals met: 13 of 54
3. (place-digit one cell07 row0 column7 subgrid2)
   deleted: (empty cell07)
   added: (usedcolumn column7 one) (usedrow row0 one) (usedsubgrid subgrid2 one)
   goals met: 14 of 54
4. (place-digit four cell30 row3 column0 subgrid3)
   deleted: (empty cell30)
   added: (usedcolumn column0 four) (usedrow row3 four) (usedsubgrid subgrid3 four)
   goals met: 15 of 54
5. (place-digit eight cell46 row4 column6 subgrid5)
   deleted: (empty cell46)
   added: (usedcolumn column6 eight) (usedrow row4 eight) (usedsubgrid subgrid5 eight)
   goals met: 16 of 54
6. (place-digit seven cell56 row5 column6 subgrid5)
   deleted: (empty cell56)
   added: (usedcolumn column6 seven) (usedrow row5 seven) (usedsubgrid subgrid5 seven)
   goals met: 17 of 54
7. (place-digit six cell42 row4 column2 subgrid3)
   deleted: (empty cell42)
   added: (usedcolumn column2 six) (usedrow row4 six) (usedsubgrid subgrid3 six)
   goals met: 18 of 54
8. (place-digit six cell27 row2 column7 subgrid2)
   deleted: (empty cell27)
   added: (usedcolumn column7 six) (usedrow row2 six) (usedsubgrid subgrid2 six)
   goals met: 19 of 54
9. (place-digit five cell43 row4 column3 subgrid4)
   deleted: (empty cell43)
   added: (usedcolumn column3 five) (usedrow row4 five) (usedsubgrid subgrid4 five)
   goals met: 20 of 54
10. (place-digit two cell53 row5 column3 subgrid4)
   deleted: (empty cell53)
   added: (usedcolumn column3 two) (usedrow row5 two) (usedsubgrid subgrid4 two)
   goals met: 21 of 54
11. (place-digit one cell55 row5 column5 subgrid4)
   deleted: (empty cell55)
   added: (usedcolumn column5 one) (usedrow row5 one) (usedsubgrid subgrid4 one)
   goals met: 22 of 54
12. (place-digit four cell03 row0 column3 subgrid1)
   deleted: (empty cell03)
   added: (usedcolumn column3 four) (usedrow row0 four) (usedsubgrid subgrid1 four)
   goals met: 23 of 54
13. (place-digit one cell13 row1 column3 subgrid1)
   deleted: (empty cell13)
   added: (usedcolumn column3 one) (usedrow row1 one) (usedsubgrid subgrid1 one)
   goals met: 24 of 54
14. (place-digit four cell54 row5 column4 subgrid4)
   deleted: (empty cell54)
   added: (usedcolumn column4 four) (usedrow row5 four) (usedsubgrid subgrid4 four)
   goals met: 25 of 54
15. (place-digit eight cell21 row2 column1 subgrid0)
   deleted: (empty cell21)
   added: (usedcolumn column1 eight) (usedrow row2 eight) (usedsubgrid subgrid0 eight)
   goals met: 26 of 54
16. (place-digit five cell11 row1 column1 subgrid0)
   deleted: (empty cell11)
   added: (usedcolumn column1 five) (usedrow row1 five) (usedsubgrid subgrid0 five)
   goals met: 27 of 54
17. (place-digit five cell37 row3 column7 subgrid5)
   deleted: (empty cell37)
   added: (usedcolumn column7 five) (usedrow row3 five) (usedsubgrid subgrid5 five)
   goals met: 28 of 54
18. (place-digit six cell58 row5 column8 subgrid5)
   deleted: (empty cell58)
   added: (usedcolumn column8 six) (usedrow row5 six) (usedsubgrid subgrid5 six)
   goals met: 29 of 54
19. (place-digit eight cell04 row0 column4 subgrid1)
   deleted: (empty cell04)
   added: (usedcolumn column4 eight) (usedrow row0 eight) (usedsubgrid subgrid1 eight)
   goals met: 30 of 54
20. (place-digit eight cell35 row3 column5 subgrid4)
   deleted: (empty cell35)
   added: (usedcolumn column5 eight) (usedrow row3 eight) (usedsubgrid subgrid4 eight)
   goals met: 31 of 54
21. (place-digit eight cell50 row5 column0 subgrid3)
   deleted: (empty cell50)
   added: (usedcolumn column0 eight) (usedrow row5 eight) (usedsubgrid subgrid3 eight)
   goals met: 32 of 54
22. (place-digit five cell06 row0 column6 subgrid2)
   deleted: (empty cell06)
   added: (usedcolumn column6 five) (usedrow row0 five) (usedsubgrid subgrid2 five)
   goals met: 33 of 54
23. (place-digit five cell52 row5 column2 subgrid3)
   deleted: (empty cell52)
   added: (usedcolumn column2 five) (usedrow row5 five) (usedsubgrid subgrid3 five)
   goals met: 34 of 54
24. (place-digit seven cell10 row1 column0 subgrid0)
   deleted: (empty cell10)
   added: (usedcolumn column0 seven) (usedrow row1 seven) (usedsubgrid subgrid0 seven)
   goals met: 35 of 54
25. (place-digit seven cell31 row3 column1 subgrid3)
   deleted: (empty cell31)
   added: (usedcolumn column1 seven) (usedrow row3 seven) (usedsubgrid subgrid3 seven)
   goals met: 36 of 54
26. (place-digit seven cell23 row2 column3 subgrid1)
   deleted: (empty cell23)
   added: (usedcolumn column3 seven) (usedrow row2 seven) (usedsubgrid subgrid1 seven)
   goals met: 37 of 54
27. (place-digit seven cell45 row4 column5 subgrid4)
   deleted: (empty cell45)
   added: (usedcolumn column5 seven) (usedrow row4 seven) (usedsubgrid subgrid4 seven)
   goals met: 38 of 54
28. (place-digit nine cell51 row5 column1 subgrid3)
   deleted: (empty cell51)
   added: (usedcolumn column1 nine) (usedrow row5 nine) (usedsubgrid subgrid3 nine)
   goals met: 39 of 54
29. (place-digit three cell57 row5 column7 subgrid5)
   deleted: (empty cell57)
   added: (usedcolumn column7 three) (usedrow row5 three) (usedsubgrid subgrid5 three)
   goals met: 40 of 54
30. (place-digit two cell40 row4 column0 subgrid3)
   deleted: (empty cell40)
   added: (usedcolumn column0 two) (usedrow row4 two) (usedsubgrid subgrid3 two)
   goals met: 41 of 54
31. (place-digit two cell16 row1 column6 subgrid2)
   deleted: (empty cell16)
   added: (usedcolumn column6 two) (usedrow row1 two) (usedsubgrid subgrid2 two)
   goals met: 42 of 54
32. (place-digit two cell22 row2 column2 subgrid0)
   deleted: (empty cell22)
   added: (usedcolumn column2 two) (usedrow row2 two) (usedsubgrid subgrid0 two)
   goals met: 43 of 54
33. (place-digit two cell38 row3 column8 subgrid5)
   deleted: (empty cell38)
   added: (usedcolumn column8 two) (usedrow row3 two) (usedsubgrid subgrid5 two)
   goals met: 44 of 54
34. (place-digit nine cell02 row0 column2 subgrid0)
   deleted: (empty cell02)
   added: (usedcolumn column2 nine) (usedrow row0 nine) (usedsubgrid subgrid0 nine)
   goals met: 45 of 54
35. (place-digit nine cell34 row3 column4 subgrid4)
   deleted: (empty cell34)
   added: (usedcolumn column4 nine) (usedrow row3 nine) (usedsubgrid subgrid4 nine)
   goals met: 46 of 54
36. (place-digit nine cell26 row2 column6 subgrid2)
   deleted: (empty cell26)
   added: (usedcolumn column6 nine) (usedrow row2 nine) (usedsubgrid subgrid2 nine)
   goals met: 47 of 54
37. (place-digit nine cell15 row1 column5 subgrid1)
   deleted: (empty cell15)
   added: (usedcolumn column5 nine) (usedrow row1 nine) (usedsubgrid subgrid1 nine)
   goals met: 48 of 54
38. (place-digit nine cell48 row4 column8 subgrid5)
   deleted: (empty cell48)
   added: (usedcolumn column8 nine) (usedrow row4 nine) (usedsubgrid subgrid5 nine)
   goals met: 49 of 54
39. (place-digit three cell18 row1 column8 subgrid2)
   deleted: (empty cell18)
   added: (usedcolumn column8 three) (usedrow row1 three) (usedsubgrid subgrid2 three)
   goals met: 50 of 54
40. (place-digit three cell00 row0 column0 subgrid0)
   deleted: (empty cell00)
   added: (usedcolumn column0 three) (usedrow row0 three) (usedsubgrid subgrid0 three)
   goals met: 51 of 54
41. (place-digit three cell32 row3 column2 subgrid3)
   deleted: (empty cell32)
   added: (usedcolumn column2 three) (usedrow row3 three) (usedsubgrid subgrid3 three)
   goals met: 52 of 54
42. (place-digit three cell44 row4 column4 subgrid4)
   deleted: (empty cell44)
   added: (usedcolumn column4 three) (usedrow row4 three) (usedsubgrid subgrid4 three)
   goals met: 53 of 54
43. (place-digit three cell25 row2 column5 subgrid1)
   deleted: (empty cell25)
   added: (usedcolumn column5 three) (usedrow row2 three) (usedsubgrid subgrid1 three)
   goals met: 54 of 54
